Revit 2027 API
FormattedText.GetPlainText Method
 Returns the entire text in a plain text form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetPlainText()
Public Function GetPlainText As String
public:
String^ GetPlainText()
member GetPlainText : unit -> string
Return Value
String
 The entire text in a plain text form.
Remarks
 The text includes a carriage return character ('\r') that is always present. As a result this method will never return an empty string.
See Also
Reference
FormattedText Class
GetPlainText Overload
Autodesk.Revit.DB Namespace